In [65]:

import numpy as np
from sqlalchemy import create_engine, inspect, URL, text
import pandas as pd
import pymysql
from tabulate import tabulate
import matplotlib.pyplot as plt
import seaborn as sns

url_object = URL.create(
  "mysql+pymysql",
  username = "team21",
  password = "te@mzi",
  host = "giniewicz.it",
  database = "team21"
)

engine = create_engine(url_object)
connection = engine.connect()

In [71]:
query2 = connection.execute(text('''SELECT g.name AS game, CONCAT(c.first_name, ' ', c.last_name) AS player, score
FROM (
  SELECT t.game_id, customer_id, SUM(score) AS score,
        ROW_NUMBER() OVER (PARTITION BY game_id ORDER BY SUM(score) DESC) AS row_num
        FROM tournament_results AS results
        LEFT JOIN tournament AS t USING(tournament_id)
        GROUP BY game_id, customer_id
) AS subquery
LEFT JOIN customers AS c USING(customer_id)
LEFT JOIN games AS g USING(game_id)
WHERE row_num IN (1,2,3,4,5,6,7,8,9,10) 
AND game_id IN (
    SELECT game_id FROM (
      SELECT DISTINCT game_id FROM tournament ORDER BY RAND() LIMIT 3
    ) AS random_games
  )
ORDER BY game_id, score DESC'''))
df2 = pd.DataFrame(query2.fetchall(), columns = query2.keys())
#print(df2)
game1 = df2['game'][0] 
game2 = df2['game'][10]
game3 = df2['game'][20]

In [72]:
df2_game1 = df2[df2['game']==game1][['player', 'score']]
df2_game2 = df2[df2['game']==game2][['player', 'score']]
df2_game3 = df2[df2['game']==game3][['player', 'score']]

In [73]:
df2_game1.reset_index(drop=True)

              player score
0      Fabian Brózda    83
1   Agnieszka Kopyto    53
2  Stanisław Mesjasz    52
3      Трохим Скирда    50
4      Šárka Fialová    49
5    Justus Schwital    48
6     Kornel Gabryel    47
7       Luboš Kučera    47
8        Liwia Blaut    46
9       Monika Krenc    46

In [74]:
print(df2_game3)

                  player score
20          Marcin Brzęk    15
21  Anastazja Żółkiewicz    14
22           Kaja Ostasz    13
23       Едуард Лавренко    13
24    Anastazja Cieciura    12
25        Ewelina Barłóg    12
26      Anna Maria Dylik    11
27       Stanisław Gryka    11
28        Konrad Nalazek    10
29      Arkadiusz Mulawa    10

In [75]:
game1

'Azul: Stained Glass of Sintra'

In [76]:
game1

'Azul: Stained Glass of Sintra'

In [77]:
game2

'Star Trek: The Adventure Game'

In [39]:
game3

'Year of the Rat: Vietnam, 1972'

In [10]:
print(df2)

               player score
0     Stavros Kallert    32
1      Петро Андрощук    31
2        Liwia Hajdas    30
3   Agnieszka Golenia    29
4     Agnieszka Zawal    28
5    Anastazja Hajdas    28
6       Suzanne Linke    27
7   Juliusz Przystupa    26
8       Dominik Kopyt    25
9        Eliza Żybura    24
10     Dagmara Siemek    21
11    Elżbieta Preuss    20
12     Nikodem Cogiel    19
13  Mirella Girschner    18
14      Dagmara Łapot    17
15  Nataniel Pacholak    16
16      Tadeáš Blažek    15
17   Fryderyk Opalach    14
18       Klara Tadych    13
19   Златослава Козак    13
20       Alex Jarmuła    38
21    Dorota Pleśniak    37
22        Nela Gogola    33
23       Maciej Łyjak    32
24        Ada Klyszcz    32
25  Krystian Niemczuk    31
26       Damian Semik    31
27   Dagmara Grochola    30
28       Marcin Boguś    30
29        Maks Hubert    29

In [41]:
df2[df2['game']==game1][['player', 'score']]

                player score
0       Марія Карпенко    67
1  Клавдія Калениченко    57
2   Maksymilian Ochnik    52
3          Симон Лупій    51
4     Natasza Plebanek    50
5      Artur Konstanty    49
6          Monika Goik    47
7        Justyna Turoń    45
8       Angelika Żabka    44
9      Oliwier Mazanek    43

In [69]:
best_player = connection.execute(text('''SELECT CONCAT(c.first_name, ' ', c.last_name) AS player, SUM(r.score) AS total_score
FROM tournament_results AS r
LEFT JOIN customers AS c USING(customer_id)
GROUP BY player
ORDER BY total_score DESC
LIMIT 1'''))

best_pl_df = pd.DataFrame(best_player.fetchall(), columns=best_player.keys())
pl = best_pl_df['player'][0]
sc = str(best_pl_df['total_score'][0])

In [70]:
sc

'106'

In [60]:
connection.close()